; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p9---int100n150-m25---int100c110---s92---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level7 level7)
(sum level0 level16 level16)
(sum level1 level1 level2)
(sum level1 level7 level8)
(sum level1 level16 level17)
(sum level2 level1 level3)
(sum level2 level7 level9)
(sum level2 level16 level18)
(sum level3 level1 level4)
(sum level3 level7 level10)
(sum level3 level16 level19)
(sum level4 level1 level5)
(sum level4 level7 level11)
(sum level4 level16 level20)
(sum level5 level1 level6)
(sum level5 level7 level12)
(sum level5 level16 level21)
(sum level6 level1 level7)
(sum level6 level7 level13)
(sum level6 level16 level22)
(sum level7 level1 level8)
(sum level7 level7 level14)
(sum level7 level16 level23)
(sum level8 level1 level9)
(sum level8 level7 level15)
(sum level8 level16 level24)
(sum level9 level1 level10)
(sum level9 level7 level16)
(sum level9 level16 level25)
(sum level10 level1 level11)
(sum level10 level7 level17)
(sum level11 level1 level12)
(sum level11 level7 level18)
(sum level12 level1 level13)
(sum level12 level7 level19)
(sum level13 level1 level14)
(sum level13 level7 level20)
(sum level14 level1 level15)
(sum level14 level7 level21)
(sum level15 level1 level16)
(sum level15 level7 level22)
(sum level16 level1 level17)
(sum level16 level7 level23)
(sum level17 level1 level18)
(sum level17 level7 level24)
(sum level18 level1 level19)
(sum level18 level7 level25)
(sum level19 level1 level20)
(sum level20 level1 level21)
(sum level21 level1 level22)
(sum level22 level1 level23)
(sum level23 level1 level24)
(sum level24 level1 level25)

(connected l0 l1)
(fuelcost level16 l0 l1)
(connected l0 l2)
(fuelcost level1 l0 l2)
(connected l1 l0)
(fuelcost level16 l1 l0)
(connected l1 l2)
(fuelcost level7 l1 l2)
(connected l2 l0)
(fuelcost level1 l2 l0)
(connected l2 l1)
(fuelcost level7 l2 l1)

(at t0 l2)
(fuel t0 level18)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l1)
(at p3 l1)
(at p4 l2)
(at p5 l2)
(at p6 l2)
(at p7 l2)
(at p8 l1)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l2)
(at p3 l2)
(at p4 l1)
(at p5 l1)
(at p6 l1)
(at p7 l1)
(at p8 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 0 of 9
2. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 9
3. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 0 of 9
4. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 9
5. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 9
6. (drive t0 l2 l0 level17 level1 level18)
   deleted: (at t0 l2) (fuel t0 level18)
   added: (at t0 l0) (fuel t0 level17)
   goals met: 0 of 9
7. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 1 of 9
8. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 9
9. (drive t0 l0 l2 level16 level1 level17)
   deleted: (at t0 l0) (fuel t0 level17)
   added: (at t0 l2) (fuel t0 level16)
   goals met: 1 of 9
10. (drive t0 l2 l1 level9 level7 level16)
   deleted: (at t0 l2) (fuel t0 level16)
   added: (at t0 l1) (fuel t0 level9)
   goals met: 1 of 9
11. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 1 of 9
12. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 1 of 9
13. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 1 of 9
14. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 9
15. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 3 of 9
16. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 4 of 9
17. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 5 of 9
18. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 6 of 9
19. (drive t0 l1 l2 level2 level7 level9)
   deleted: (at t0 l1) (fuel t0 level9)
   added: (at t0 l2) (fuel t0 level2)
   goals met: 6 of 9
20. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 7 of 9
21. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 8 of 9
22. (drive t0 l2 l0 level1 level1 level2)
   deleted: (at t0 l2) (fuel t0 level2)
   added: (at t0 l0) (fuel t0 level1)
   goals met: 8 of 9
23. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 9 of 9
